from telethon.sync import TelegramClient
import random
import time

api_id = '22684619'
api_hash = '5e192449bc0a7380eb47164c883776f1'  
phone = '+212750410356'  

messages_pool = [
    "كس امك ",
    "يابن الكاثوليكية",
    "يابن الزواني",
    "يابن المديثة",
    "يابن اقحب قحبه",
    "مسوي رجال ياكس امك",
    "وش بطيز خالتك يابن القحبه",
    "انت ديوث يابن الديوث",
    "كس امك يابن المستخنثه",
    "قم اصمل قدامي لانيك مستخلفتك",
    "يابن القحبانية ي ديوث",
    "وش في كس امك هاذا ياديوث",
    "انا بنيك خالتك ذي ي ابن اليهودية الشمطاء يابن مساكة طيز امك",
    "انت مسوي تصمل معي يعني يابن القحبه ي ولد اليهودية",
    "طيز امك يدور هلاكة ورا زبي يابن الديوث يابن المستخنثه",
    "انت طيز خالتك منطوي على أفعال الدياثة والمديثة تفهم ي يابن الديوث",
    "قم قدامي لانيك لك خالتك القحبانية ي ولد الشرموطة",
    "انت وش فيك كذا يابن الديوث ماتصمل هاه علمني يابن القحبه",
    "بدخل طيز امك الجغرافيا وانيك امك بكل أوساط الحياة",
    "انت بنيك خدامتكم يابن العاهره لالا مابي يابن القحبه ناقصني ايدز متوارث من عائله دياثتكم",
    "امشي يابن الي تتساحق مع عشره وستة وخمستعشر واحد ي ولد الهايمة القايمة",
    "انت طيز خالتك يحاول يصمل معي لكن مشكلته ينركض وينشلت كل ماحاول يصمل",
    "يابن الديوث وش فيك علي كذا يابن القحبه تبغاني انيك كس امك ولا وش",
    "يابن القحبه انت ولد مديثة يابن المعربدة ي ديوث",
    "يابن القحبه انت الفناء وانا البقاء انا باقي هنا عشان أشيل كس امك هاذا يابن القحبه",
    "يابن العاهرة"  ,
"يا ابن الدجالة"  ,
"يا ابن الزانية"  ,
"يا ابن الفاجرة"  ,
"يا ابن الخائنة"  ,
"يا ابن الكاذبة"  ,
"يا ابن الغادرة"  ,
"يا ابن الناكرة"  ,
"يا ابن العاقة"  ,
"يا ابن الجاحدة"  ,
"يا ابن الفاسقة"  ,
"يا ابن المارقة"  ,
"يا ابن المنحرفة"  ,
"يا ابن الضالة"  ,
"يا ابن الباطلة"  ,
"ياخو الفاجرة",
"يا ابن الزائفة"  ,
"يا ابن المدعية"  ,
"يا ابن المتلونة"  ,
"يا ابن المنافقة"  ,
"يا ابن المرائية"  ,
"يا ابن المضللة"  ,
"ياخو القحبه",
"يا ابن المغوية"  ,
"يا ابن الفتانة"  ,
"يا ابن النمامة"  ,
"يا ابن الحسودة"  ,
"يا ابن الحقودة"  ,
"يا ابن البغيضة"  ,
"بطعن خالتك",
"يا ابن الكريهة"  ,
"يا ابن اللعينة"  ,
"يا ابن الملعونة"  ,
"يا ابن الشريرة"  ,
"نيك نيك امك يابن القحبه",
"يا ابن الخبيثة"  ,
"يا ابن النجسة"  ,
"يا ابن القذرة"  ,
"يا ابن الدنيئة"  ,
"يا ابن الوضيعة"  ,
"يا ابن السفيهة" 
"ليش تسولف ياخو المديثه", 
"يا ابن الحمقاء"  ,
"يا ابن الطائشة"  ,
"يا ابن المتهورة"  ,
"كس امك كل زق امك",
"يا ابن الجاهلة"  ,
"يا ابن العمياء"  ,
"خختفو على امك",
"يا ابن الصماء"  ,
"بتفل بوجة امك",
"يا ابن البكماء"  ,
"يا ابن العرجاء"  ,
"الحين امك تحسبني نسوخي يابن الزانية جاوب؟",
"كس امك كل زق امك",
"يا ابن الشلاء"  ,
"يا ابن المشوهة"  ,
"يا ابن المنبوذة"  ,
"الحين امك تحسبني نسوخي يابن القحبه؟",
"يا ابن المنبوذ"  ,
"يا ابن الحقير"  ,
"بزني بامك",
"يا ابن الذليل"  ,
"يا ابن الصغير"  ,
"من ناك امك يابن القحبه",
"تحسبني نسوخي؟",
"انيك قبر امك",
"يا ابن التافه"  ,
"بسلق عرضك",
"امص زب امك المقرمش",
"يا ابن الهامشي"  ,
"يا ابن الضائع"  ,
"يا ابن الشارد"  ,
"يا ابن المنقطع"  ,
"يا ابن البائس"  ,
"يا ابن الشقي"  ,
"يا ابن التعيس"  ,
"يا ابن المنكود"  ,
"يا ابن المحروم"  ,
"يا ابن الفاقد"  ,
"كس امك",
"كس خالتك",
"بزني بعرضك",
"كس اخت امك",
"يا ابن العديم"  ,
"يا ابن الخالي"  ,
"يا ابن الفارغ"  ,
"يا ابن الأجوف"  ,
"يا ابن الضعيف"  ,
"يا ابن الواهن"  ,
"يا ابن العاجز"  ,
   "كس امك ذا يحاول يصمل معي يابن الزانية ي ديوث",
   "يابن اقحب قحبة",
"يابن القحبانية",
"بنيك عرضك بارضك",
"اغتصب مرداف امك",
"يابن اقحب قحبة",
"ازني بخالاتك",
"يابن القحاب",
"يابن المسترخصة",
"بتصمل معي ولا شلون",
"انت طيز امك ضعيف لدرجة هيدروجينة من كثر النيكات والتندس",
"انت كس امك شفية يتطاير علينا",
"يابن من سارت ودارت",
"يابن المشخوطة",
"يابن الساخطة",
"يا ليل بهيم تائه في دهاليز العتمة",
"علمني من ناك امك",
"طيز امك ينفلت علي",
"يابن القحبه شفيك تسبني",
"امك تبغى تزغبني",
"ياكس امك",
"مسوي قوي",
"انيك خواتك قدامك",
"انيك عرض امك",
"امك مشقوقة",
"انيك أمك بنت الدعارة",
"يابن المساجد",
"يابن المراقص",
"يابن الهزازه",
"العن كس امك",
"امك وثنية ولا وش ",
"بعض كسمك",
"انيك مستخلفتك",
"يابن المرمية",
"ياديوث امك",
"ياديوث اختك",
"بمسك جدتك وارجمها على زبي",
"احط زبي بكس اهلك",
"احط زبي بكس اختك",
"يابن السرمدية",
"يابن النابية",
"يابن الهايتة",
"يابن العاتية",
"كسختمك اسكت",
"ياشقاق امك",
"يانياك عار امك",
"اغتصب مجاديف امك",
"انيك رحاب امك",
"لاعد تسوي قوي",
"انا فحل امك",
"انا فحل خالتك",
"انا نياك امك",
"اغتصب خوات امك",
"بجيب امك",
"يا ابن القحبة",
"يابن العاتية",
"يابن الهايتة",
"يابن النابية",
"يابن الادغال",
"امك مسربتة",
"انشر طيز امك",
"امص زب امك",
"هي ي ديوث",
"يابن القحبنجية",
"امك مازوخية",
"كس اختك",
"ابوس طيز امك",
"يابن الهندية",
"امك تعاشر تسعة رجال",
"ياخو المخنثة",
"احط امك فوق زبي",
"ازرف راس امك",
"الحس طيز امك"
" انيك حريم بيتك",
"ياديوث",

]

targets = [
    "https://t.me/+KUqJRlqz5IQ0ZDMy",
]

with TelegramClient('session_name', api_id, api_hash) as client:
    client.start(phone)
    
    used_messages = []  
    
    while True:
        if len(used_messages) >= len(messages_pool) - 2:
            used_messages = []
        available_msgs = [msg for msg in messages_pool if msg not in used_messages]
        selected_msgs = random.sample(available_msgs, 3)

        combined_msg = " ".join(selected_msgs)
        
        line_count = combined_msg.count('\n') + 1
        delay = 2.7 if line_count > 3 else 1.9
        
        try:
            for target in targets:
                client.send_message(target, combined_msg)
                print(f"تم الإرسال إلى {target} 😝: {combined_msg}")
            
            used_messages.extend(selected_msgs)
            time.sleep(delay)  
           
        except Exception as e:
            print(f"خطأ في الإرسال 😓 : {e}")
            time.sleep(delay)
        
        print(f"--- انتظر {delay} ثانية قبل الإرسال التالي 🐾 ---")
        time.sleep(delay)